//1.数组的使用
#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	int i=0;
	int arr[10]={1,2,3,4,5,6,7,8,9,10};//定义一个存放10个整数数字的数组
	while(i<10)
	{
		printf("%d\n",arr[i]);
		i++;
	}
	return 0;
}

//2.取余，取模，左移（移位操作符）
/*#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	int a=5/2;
	int b=7%2;//取模，即取余数
	int c=3;//整形c=3占4个字节-32个bit位，用二进制可表示为00000000000000000000000000000011；
	int d=c<<1;//此时其二进制表示方法中，各个位置上的数字左移1位，第一个零被丢弃，后面在补上一个0；
	//移位后变为00000000000000000000000000000110；其转变为十进制值为6；
	//用d来接收c左移1位后的值
	int e=c<<2;//此时其二进制表示方法中，各个位置上的数字左移2位，前两个零被丢弃，后面在补上两个0；
	//移位后变为00000000000000000000000000001100；其转变为十进制值为12；
	//用e来接收c左移2位后的值
	printf("%d\n",a);
	printf("%d\n",b);
	printf("%d\n",d);
	printf("%d\n",e);
	//移位操作符（移动二进制）
	//  <<左移
	//  >>右移
	return 0;
}*/

//3.（二进制）位操作、&按位与、|按位或、^按位异或
/*#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	//(二进制)位操作
	//& 按位与
	//| 按位或
	//^ 按位异或
	int a=3;//十进制3的二进制表示为011；
	int b=5;//101
	int c=a&b;//a与上b，相当于其二进制之间互与，即011与101同位次之间与，0与1得0，1与1得1，所以c=001（二进制）,十进制值为1,
	int d=a|b;//类似上面，“或”的规则，1或0得1，0或0得0，1或1得1，此处得十进制数值为7（111）
	int e=a^b;//异或的计算规律为，对应二进制位置相同，则为0，相异则为1；此处得十进制数值为6（110）
	printf("%d\n",c);
	printf("%d\n",d);
	printf("%d\n",e);
	return 0;
}*/

//4.单目操作符、双目操作符、三目操作符
/*#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	int a=10;
	a=a+10;//等价于a+=10;
	//单目操作符、双目操作符、三目操作符
	//例如
	int b=20;
	int c=30;
	int d=0;
	d=a+b;//+加号操作符，左右两边都有操作数，共两个操作数，所以是双目操作数
	return 0;
}*/

//5.子函数的使用
/*#define _CRT_SECURE_NO_WARNINGS 1
//EOF---end of file文件结束标志-1
int MAX(int x,int y)//定义函数为整形，返回值为整形
{
	if(x>y)
		return x;
	else
		return y;
}
#include<stdio.h>
int main()
{
	int num1=10;
	int num2=20;
	int max=0;
	max=MAX(num1,num2);//调用子函数
	printf("%d\n",max);
	return 0;
}*/

//6.原码、反码、补码
/*#define _CRT_SECURE_NO_WARNINGS 1
//“~”波浪号是按（二进制）位取反，
//例如：1010取反后是0101，取反时，0变成1，1变为0
#include<stdio.h>
int main()
{
	int a=0;//0用二进制表示为00000000000000000000000000000000；//int是4个字节，1个字节8个位
	int b=~a;//b是有符号的整形，其第一位是符号位（下一行中第一个1，二进制中的最高位），1表示为负数，0表示为正数
	//取反后为11111111111111111111111111111111
	//假设上面一行是补码，如何求其源码
	//源码符号位不变，其他位取反，得到反码，反码加1得到补码
	//补码减一得到反码，反码符号位不变，按位取反得到源码
	//111111111111111111111111111111111-(00000000000000000000000000000000)1=11111111111111111111111111111110；补码得到反码
	//11111111111111111111111111111110---->10000000000000000000000000000001；反码得到原码
	//此处10000000000000000000000000000001十进制表达式为-1；
	int c=6;//00000000000000000000000000000110
	int d=~c;//11111111111111111111111111111001;
	//补码到反码：11111111111111111111111111111001-1=11111111111111111111111111111000；
	//反码到原码：10000000000000000000000000000111；第一个1表示符号，后面0111十进制值为7，合起来和-7
	printf("%d\n",b);//打印的是这个数的原码，得-1
	printf("%d\n",d);//得-7
	return 0;
}
//原码、反码、补码
//负数在内存中存储的时候，存储的是二进制的补码*/